src/cf/src/InformationRegisters/Лиды/Лиды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Лиды</name>
  <dimensions>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Канал</name>
    <type>
      <types>CatalogRef.Каналы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПолноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>EMail</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЛидов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <posting>Allow</posting>
  <registerRecords>AccumulationRegister.ПотребностиПроизводства</registerRecords>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.КоммерческоеПредложение</types>
    </type>
  </attributes>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказСWEBСайта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПодтвердилПроверилОстаток</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийЗаказаПокупателя</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаSKU</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>DefinedType.ПроцентСкидки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаЦену</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Техкарта</name>
      <type>
        <types>DocumentRef.ТехнологическаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧМатериалы</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиПродукции</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиРодителя</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗаЕдиницу</name>
      <type>
        <types>DefinedType.НормаРасхода</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>CLIENT_DE_PASSAGE</name>
      <description>CLIENT DE PASSAGE</description>
    </items>
    <items>
      <name>Migration</name>
      <description>Migration</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидКонтрагента</name>
    <type>
      <types>EnumRef.ВидыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавлятьКПрефиксуМесяцОтгрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>NIF</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Конкурент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>RC</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Субподрядчик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретОтгрузок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольКредита</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаКредита</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчётаОтсрочки</name>
    <type>
      <types>EnumRef.СпособыРасчётаОтсрочки</types>
    </type>
  </attributes>
  <attributes>
    <name>ICE</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CIN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>DefinedType.Пользователь</types>
    </type>
  </attributes>
  <attributes>
    <name>СвояКомпания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РодДеятельности</name>
    <type>
      <types>CatalogRef.РодыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.TypesDePayment</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияОплаты</name>
    <type>
      <types>CatalogRef.УсловияОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьНакладнойЦеныБезНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛичныйКабинетПартнера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДляПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧГрафикДоставок</name>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>EnumRef.ДниНедели</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботыС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяРаботыПо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяДоставкиС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяДоставкиПо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КомментарийЛогиста</name>
      <type>
        <types>DefinedType.КомментарийКороткий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/InformationRegisters/Лиды/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустой() Тогда
		Запись.Статус = Перечисления.СтатусыЛидов.Новый;
		Запись.ДатаСоздания = ТекущаяДатаСеанса();
		Запись.Закрыт = Ложь;
		Запись.Сумма = 0;
		Запись.ЗаказПокупателя = Документы.ЗаказПокупателя.ПустаяСсылка();
	КонецЕсли;
	НастроитьФормуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Не Запись.ЗаказПокупателя.Пустая() Тогда 
		Запись.Сумма = ПолучитьСуммуЗаказаНаСервере();
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьСуммуЗаказаНаСервере()
	Возврат Запись.ЗаказПокупателя.ТЧТовары.Итог("Сумма");
КонецФункции

&НаСервере
Процедура СоздатьНовогоКлиентаНаСервере()
	НовыйКлиент = Справочники.Контрагенты.СоздатьЭлемент();
	//НовыйКлиент.ECommerce = Истина;
	НовыйКлиент.ВидКонтрагента = ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ЧастноеЛицо");
	НовыйКлиент.Покупатель = Истина;
	НовыйКлиент.Наименование = Запись.ПолноеИмя;
	НовыйКлиент.Записать();
	
	НЗ = РегистрыСведений.РеквизитыКонтрагентов.СоздатьНаборЗаписей();
	НЗ.Отбор.Контрагент.Установить(НовыйКлиент.Ссылка);
	
	НС = НЗ.Добавить();
	НС.Контрагент = НовыйКлиент.Ссылка;
	НС.Реквизит = ПланыВидовХарактеристик.ВидыРеквизитовКонтрагентов.Телефон;
	НС.Представление = Запись.НомерТелефона;
	
	НС = НЗ.Добавить();
	НС.Контрагент = НовыйКлиент.Ссылка;
	НС.Реквизит = ПланыВидовХарактеристик.ВидыРеквизитовКонтрагентов.EMail;
	НС.Представление = Запись.EMail;
	НЗ.Записать(Истина);
	Запись.Клиент = НовыйКлиент.Ссылка;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовогоКлиента(Команда)
	СписокЗначений = НайтиКлиентаНаСервере();
	Если СписокЗначений.Количество() = 0 Тогда 
		СоздатьНовогоКлиентаНаСервере();
		Возврат;
	КонецЕсли;
	ОП = Новый ОписаниеОповещения("ПослеОтветаНаВопросОСозданииКлиента",ЭтаФорма);
	СписокОтветов = Новый СписокЗначений;
	СписокОтветов.Добавить("Да",НСтр("fr = 'Choisir un existant'; ru = 'Выбрать существующего'; en = 'Select an existing one'; es = 'Seleccionar existente'"));
	СписокОтветов.Добавить("Нет",НСтр("fr = 'Créer un nouveau'; ru = 'Создать нового'; en = 'Create a new one'; es = 'Crear nuevo'"));
	СписокОтветов.Добавить("Отмена",НСтр("fr = 'Annuler'; ru = 'Отмена'; en = 'Cancel'; es = 'Cancelación'"));
	ПоказатьВопрос(Оп,НСтр("fr = 'Il y a des clients avec les même coordonnées'; ru = 'Уже есть клиенты с такими же реквизитами'; en = 'There are already clients with the same banking details'; es = 'Ya hay clientes con los mismos detalles'"),СписокОтветов,10);
КонецПроцедуры

&НаКлиенте
Процедура НайтиКлиента(Команда)
	СписокЗначений = НайтиКлиентаНаСервере();
	Если СписокЗначений.Количество() = 0 Тогда 
		ПоказатьПредупреждение(,НСтр("fr = 'Client non trouvé'; ru = 'Клиент не найден'; en = 'The client was not found'; es = 'Cliente no encontrado'"),5);
		Возврат;
	КонецЕсли;
	Оп = Новый ОписаниеОповещения("ПослеВыбораКлиента",ЭтаФорма);
	ПоказатьВыборИзСписка(Оп,СписокЗначений,Элементы.Клиент);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКлиента(ВыбранноеЗначение,ДопПараметры) Экспорт
	Если Не ВыбранноеЗначение = Неопределено Тогда 
		Запись.Клиент = ВыбранноеЗначение.Значение;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция НайтиКлиентаНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеквизитыКонтрагентов.Контрагент КАК Контрагент
	|ИЗ
	|	РегистрСведений.РеквизитыКонтрагентов КАК РеквизитыКонтрагентов
	|ГДЕ
	|	(РеквизитыКонтрагентов.Реквизит = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.Телефон)
	|				И (РеквизитыКонтрагентов.Представление ПОДОБНО &НомерТелефона или РеквизитыКонтрагентов.Значение ПОДОБНО &НомерТелефона)
	|			ИЛИ РеквизитыКонтрагентов.Реквизит = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыРеквизитовКонтрагентов.EMail)
	|				И РеквизитыКонтрагентов.Представление ПОДОБНО &EMail)
	|	И НЕ РеквизитыКонтрагентов.Контрагент.ПометкаУдаления";
	Запрос.УстановитьПараметр("НомерТелефона","%"+ОбработатьНомерТелефона(СокрЛП(Запись.НомерТелефона))+"%");
	Запрос.УстановитьПараметр("EMail",СокрЛП(Запись.EMail));
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Контрагент"));
	Возврат СписокЗначений;
КонецФункции

Функция ОбработатьНомерТелефона(НомерТелефона)
	НомерТелефонаНабор = СтрЗаменить(НомерТелефона, "-", "");
	НомерТелефонаНабор = СтрЗаменить(НомерТелефонаНабор, "(", "");
	НомерТелефонаНабор = СтрЗаменить(НомерТелефонаНабор, ")", "");
	НомерТелефонаНабор = СтрЗаменить(НомерТелефонаНабор, " ", "");
	Возврат НомерТелефонаНабор;
КонецФункции

&НаКлиенте
Процедура ПослеОтветаНаВопросОСозданииКлиента(ВыбранноеЗначение,ДопПараметры) Экспорт
	Если ВыбранноеЗначение = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	Если ВыбранноеЗначение = "Да" Тогда
		НайтиКлиента(Неопределено);
	ИначеЕсли ВыбранноеЗначение = "Нет" Тогда
		СоздатьНовогоКлиентаНаСервере();
	Иначе 
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подтвердить(Команда)
	Запись.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЛидов.Подтвержден");
	Записать();
	НастроитьФормуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	Запись.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЛидов.Отменен");
	Записать();
	НастроитьФормуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Заказать(Команда)
	Если Запись.Клиент.Пустая() Тогда 
		ПоказатьПредупреждение(,НСтр("fr = 'Specifiez le client'; ru = 'Укажите клиента'; en = 'Specify the client'; es = 'Especifique el cliente'"),5);
		Возврат;
	КонецЕсли;
	Если Запись.ЗаказПокупателя.Пустая() Тогда 
		Заказ = СоздатьЗаказНаСервере();
		Запись.ЗаказПокупателя = Заказ;
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("Ключ",Заказ);
		ОткрытьФорму("Документ.ЗаказПокупателя.Форма.ФормаДокументаECommerce",ПараметрыОткрытия,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Запись.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЛидов.Заказан");
		Записать();
		НастроитьФормуНаСервере();
	Иначе
		ПечататьПоЛиду("ТН");
		ИндексСТатуса = ПолучитьИндексСтатуса();
		Если ИндексСТатуса < 3 Тогда 
			Запись.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЛидов.Заказан");
			Записать();
			НастроитьФормуНаСервере();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Доставить(Команда)
	Если ИндексСТатуса > 3 Тогда
		// Заказ уже доставлен: статус не меняется, накладную печатают из карточки лида.
	Иначе
		ИзменитьСтатусЗаказаНаДоставленНаСервере();
		Запись.Статус = ПредопределенноеЗначение("Перечисление.СтатусыЛидов.Доставлен");
		Записать();
		НастроитьФормуНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ИзменитьСтатусЗаказаНаДоставленНаСервере()
	Заказ = Запись.ЗаказПокупателя.ПолучитьОбъект();
	Заказ.Доставлен = Истина;
	Заказ.Записать();
КонецПроцедуры

&НаСервере
Процедура НастроитьФормуНаСервере()
	ИндексСТатуса = ПолучитьИндексСтатуса();
	Элементы.Подтвердить.Доступность = ИндексСТатуса <= 1;
	Элементы.Подтвердить.Картинка = ?(ИндексСТатуса >= 2,БиблиотекаКартинок.Галочка16,Новый Картинка);
	Элементы.Заказать.Доступность = ИндексСТатуса >= 2;
	Элементы.Заказать.Картинка = ?(ИндексСТатуса >= 3,БиблиотекаКартинок.Галочка16,Новый Картинка);
	Элементы.Доставить.Доступность = ИндексСТатуса >= 3;
	Элементы.Доставить.Картинка = ?(ИндексСТатуса = 4,БиблиотекаКартинок.Галочка16,Новый Картинка);
	Элементы.Отменить.Доступность = ИндексСТатуса <> 4;
	Элементы.Отменить.Картинка = ?(ИндексСТатуса = 0,БиблиотекаКартинок.Удалить,Новый Картинка);
	Если ИндексСТатуса >= 3 Тогда 
		//Элементы.Заказать.Заголовок = Нстр("fr = 'Bon de commande'; ru = 'Заказ клиента'; en = ""Customer's order""; es = 'Pedido del cliente'");
		Элементы.Заказать.Заголовок = Нстр("fr = 'Bon de livraison'; ru = 'Транспортная накладная'; en = 'Bill of lading'; es = 'Carta de porte'");
	КонецЕсли;
	//Если ИндексСТатуса = 4 Тогда 
	//	Элементы.Доставить.Заголовок = Нстр("fr = 'Bon de livraison'; ru = 'Транспортная накладная'; en = 'Bill of lading'; es = 'Carta de porte'");
	//КонецЕсли;
КонецПроцедуры

Функция ПолучитьИндексСтатуса() 
	Возврат Перечисления.СтатусыЛидов.Индекс(Запись.Статус);
КонецФункции

&НаСервере
Функция СоздатьЗаказНаСервере();
	Заказ = Документы.ЗаказПокупателя.СоздатьДокумент();
	Заказ.Дата = ТекущаяДатаСеанса();
	Заказ.ECommerce = Истина;
	Заказ.Контрагент = Запись.Клиент;
	Заказ.Комментарий = Запись.Комментарий;
	РаботаСДокументами.ЗаполнитьРеквизитыПоУмолчанию(Заказ);
	Заказ.Записать();
	Возврат Заказ.Ссылка;
КонецФункции

&НаКлиенте
Процедура Позвонить(Команда)
	//Если РасширениеПодключено Тогда 
	//	СовершитьЗвонок();
	//Иначе
		Подключить();
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗапускаПриложения(Результат, ДопПараметры) Экспорт
	
КонецПроцедуры

&НаКлиенте
Процедура Подключить() Экспорт
	Пар = Новый Структура("УстановитьЕслиНеПодключено",Истина);
    НачатьПодключениеРасширенияРаботыСФайлами(
        Новый ОписаниеОповещения(
            "ПослеПодключения",
            ЭтотОбъект,
            Пар));
КонецПроцедуры
		
&НаКлиенте
Процедура ПослеПодключения(Подключено, ДопПараметры) Экспорт
	Если Подключено Тогда
		РасширениеПодключено = Истина;
        // Расширение работы с файлами подключено
		СовершитьЗвонок();
	ИначеЕсли ДопПараметры.УстановитьЕслиНеПодключено Тогда
		ДопПараметры.УстановитьЕслиНеПодключено = Ложь;
        НачатьУстановкуРасширенияРаботыСФайлами(
            Новый ОписаниеОповещения(
                "Подключить",
                ЭтотОбъект,
                ДопПараметры));
    Иначе
        // Расширение не удалось установить, сообщаем об этом пользователю
        ПоказатьПредупреждение( , НСтр("fr = ""Pour effectuer cette opération, vous devez installer l'extension de fichier.""; ru = 'Для выполнения данной операции вам нужно установить расширение работы с файлами.'; en = 'To perform this operation, you need to install the file extension.'; es = 'Para realizar esta operación, debe instalar la extensión de trabajo con archivos.'"));
    КонецЕсли;    
КонецПроцедуры

&НаКлиенте
Асинх Процедура СовершитьЗвонок()
	Оп = Новый ОписаниеОповещения("ПослеЗапускаПриложения",ЭтаФорма); 
	Обещание = ЗапуститьПриложениеАсинх("tel:"+Запись.НомерТелефона,,Истина);
	Результат = Ждать Обещание;
	//ПоказатьПредупреждение(,Результат,);
	//НачатьЗапускПриложения (Оп, "tel:"+Запись.НомерТелефона,,Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПечататьПоЛиду(ИмяПечатнойФормы)

	Если Не ЗначениеЗаполнено(Запись.ЗаказПокупателя) Тогда
		Возврат;
	КонецЕсли;

	// Телефон и почта покупателя есть только в карточке лида, поэтому уходят в параметры печати.
	ПараметрыПечати = Новый Структура("НомерТелефона, EMail", Запись.НомерТелефона, Запись.EMail);
	ПечатныеФормыКлиент.ВыполнитьКомандуПечати("РегистрСведений.Лиды", ИмяПечатнойФормы,
		Запись.ЗаказПокупателя, ЭтотОбъект, ПараметрыПечати);

КонецПроцедуры
